; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=369, out_folder=htg/blocksworld/training, instance_id=83, seed=2107, goal_proportion=0.03

(define (problem blocksworld-83)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 - object)
 (:init 
    (arm-empty)
    (clear b240)
    (on-table b240)
    (clear b287)
    (on-table b287)
    (clear b277)
    (on b277 b235)
    (on b235 b161)
    (on-table b161)
    (clear b71)
    (on b71 b55)
    (on b55 b205)
    (on b205 b150)
    (on b150 b155)
    (on b155 b259)
    (on b259 b355)
    (on b355 b273)
    (on b273 b85)
    (on b85 b106)
    (on b106 b122)
    (on b122 b212)
    (on b212 b296)
    (on b296 b149)
    (on b149 b26)
    (on b26 b336)
    (on-table b336)
    (clear b35)
    (on b35 b340)
    (on b340 b36)
    (on b36 b130)
    (on b130 b349)
    (on b349 b185)
    (on b185 b227)
    (on b227 b125)
    (on b125 b83)
    (on b83 b278)
    (on-table b278)
    (clear b361)
    (on b361 b175)
    (on b175 b311)
    (on b311 b262)
    (on b262 b25)
    (on b25 b119)
    (on-table b119)
    (clear b11)
    (on b11 b92)
    (on-table b92)
    (clear b2)
    (on b2 b56)
    (on b56 b144)
    (on-table b144)
    (clear b139)
    (on b139 b77)
    (on b77 b266)
    (on b266 b169)
    (on-table b169)
    (clear b131)
    (on b131 b233)
    (on b233 b356)
    (on-table b356)
    (clear b293)
    (on b293 b297)
    (on b297 b40)
    (on b40 b285)
    (on b285 b347)
    (on b347 b163)
    (on b163 b33)
    (on b33 b179)
    (on b179 b199)
    (on b199 b160)
    (on b160 b192)
    (on b192 b157)
    (on b157 b316)
    (on b316 b295)
    (on b295 b120)
    (on-table b120)
    (clear b276)
    (on b276 b79)
    (on b79 b249)
    (on b249 b87)
    (on b87 b352)
    (on-table b352)
    (clear b171)
    (on b171 b42)
    (on b42 b299)
    (on b299 b329)
    (on b329 b332)
    (on-table b332)
    (clear b34)
    (on-table b34)
    (clear b257)
    (on b257 b126)
    (on b126 b322)
    (on-table b322)
    (clear b133)
    (on b133 b20)
    (on-table b20)
    (clear b243)
    (on b243 b117)
    (on b117 b124)
    (on-table b124)
    (clear b102)
    (on b102 b360)
    (on-table b360)
    (clear b146)
    (on-table b146)
    (clear b148)
    (on b148 b22)
    (on b22 b153)
    (on b153 b282)
    (on b282 b298)
    (on-table b298)
    (clear b341)
    (on b341 b209)
    (on-table b209)
    (clear b113)
    (on b113 b272)
    (on-table b272)
    (clear b208)
    (on b208 b39)
    (on b39 b284)
    (on b284 b321)
    (on b321 b158)
    (on b158 b279)
    (on-table b279)
    (clear b141)
    (on b141 b224)
    (on b224 b344)
    (on b344 b94)
    (on-table b94)
    (clear b222)
    (on b222 b176)
    (on-table b176)
    (clear b324)
    (on-table b324)
    (clear b271)
    (on b271 b105)
    (on-table b105)
    (clear b220)
    (on b220 b118)
    (on b118 b286)
    (on b286 b255)
    (on b255 b84)
    (on b84 b24)
    (on-table b24)
    (clear b115)
    (on b115 b19)
    (on b19 b29)
    (on-table b29)
    (clear b52)
    (on b52 b48)
    (on b48 b363)
    (on b363 b345)
    (on b345 b330)
    (on b330 b251)
    (on b251 b12)
    (on b12 b111)
    (on b111 b46)
    (on b46 b310)
    (on b310 b165)
    (on-table b165)
    (clear b99)
    (on b99 b53)
    (on-table b53)
    (clear b213)
    (on b213 b244)
    (on-table b244)
    (clear b49)
    (on b49 b88)
    (on-table b88)
    (clear b333)
    (on b333 b174)
    (on-table b174)
    (clear b230)
    (on b230 b246)
    (on b246 b232)
    (on b232 b234)
    (on b234 b215)
    (on-table b215)
    (clear b181)
    (on b181 b170)
    (on b170 b191)
    (on b191 b152)
    (on b152 b291)
    (on-table b291)
    (clear b242)
    (on b242 b178)
    (on b178 b114)
    (on b114 b281)
    (on b281 b364)
    (on b364 b206)
    (on b206 b339)
    (on-table b339)
    (clear b187)
    (on b187 b93)
    (on b93 b15)
    (on b15 b194)
    (on b194 b86)
    (on b86 b369)
    (on-table b369)
    (clear b308)
    (on b308 b256)
    (on b256 b75)
    (on b75 b250)
    (on b250 b103)
    (on-table b103)
    (clear b173)
    (on b173 b57)
    (on-table b57)
    (clear b127)
    (on-table b127)
    (clear b138)
    (on b138 b73)
    (on b73 b202)
    (on b202 b218)
    (on-table b218)
    (clear b223)
    (on b223 b95)
    (on b95 b162)
    (on b162 b188)
    (on b188 b166)
    (on b166 b27)
    (on-table b27)
    (clear b309)
    (on b309 b254)
    (on-table b254)
    (clear b121)
    (on b121 b164)
    (on-table b164)
    (clear b245)
    (on b245 b96)
    (on b96 b76)
    (on b76 b91)
    (on-table b91)
    (clear b108)
    (on b108 b32)
    (on b32 b331)
    (on b331 b134)
    (on b134 b253)
    (on-table b253)
    (clear b236)
    (on b236 b368)
    (on b368 b63)
    (on b63 b90)
    (on-table b90)
    (clear b183)
    (on b183 b82)
    (on b82 b190)
    (on b190 b135)
    (on b135 b4)
    (on b4 b306)
    (on b306 b334)
    (on b334 b128)
    (on-table b128)
    (clear b5)
    (on b5 b219)
    (on-table b219)
    (clear b204)
    (on-table b204)
    (clear b366)
    (on b366 b58)
    (on b58 b132)
    (on b132 b97)
    (on-table b97)
    (clear b292)
    (on b292 b290)
    (on b290 b151)
    (on b151 b1)
    (on b1 b21)
    (on b21 b43)
    (on b43 b129)
    (on b129 b123)
    (on b123 b80)
    (on b80 b186)
    (on b186 b78)
    (on b78 b225)
    (on b225 b156)
    (on b156 b89)
    (on b89 b231)
    (on b231 b351)
    (on b351 b167)
    (on b167 b307)
    (on b307 b315)
    (on b315 b45)
    (on b45 b312)
    (on b312 b195)
    (on b195 b154)
    (on-table b154)
    (clear b184)
    (on-table b184)
    (clear b367)
    (on b367 b18)
    (on-table b18)
    (clear b147)
    (on-table b147)
    (clear b211)
    (on b211 b226)
    (on b226 b110)
    (on b110 b217)
    (on-table b217)
    (clear b264)
    (on-table b264)
    (clear b159)
    (on b159 b177)
    (on b177 b200)
    (on-table b200)
    (clear b101)
    (on b101 b326)
    (on-table b326)
    (clear b238)
    (on b238 b143)
    (on b143 b6)
    (on b6 b16)
    (on b16 b317)
    (on-table b317)
    (clear b198)
    (on b198 b229)
    (on b229 b50)
    (on b50 b65)
    (on b65 b362)
    (on-table b362)
    (clear b302)
    (on b302 b70)
    (on b70 b210)
    (on b210 b180)
    (on b180 b327)
    (on b327 b237)
    (on b237 b3)
    (on b3 b214)
    (on b214 b288)
    (on b288 b314)
    (on b314 b342)
    (on b342 b294)
    (on b294 b100)
    (on-table b100)
    (clear b38)
    (on b38 b98)
    (on-table b98)
    (clear b274)
    (on-table b274)
    (clear b207)
    (on b207 b335)
    (on b335 b263)
    (on-table b263)
    (clear b74)
    (on b74 b304)
    (on b304 b357)
    (on b357 b283)
    (on-table b283)
    (clear b313)
    (on b313 b13)
    (on b13 b358)
    (on b358 b252)
    (on b252 b9)
    (on b9 b359)
    (on b359 b260)
    (on b260 b116)
    (on b116 b60)
    (on b60 b189)
    (on b189 b201)
    (on b201 b61)
    (on b61 b270)
    (on b270 b354)
    (on b354 b203)
    (on b203 b323)
    (on b323 b7)
    (on b7 b112)
    (on b112 b221)
    (on b221 b54)
    (on-table b54)
    (clear b248)
    (on-table b248)
    (clear b140)
    (on b140 b62)
    (on b62 b241)
    (on b241 b353)
    (on-table b353)
    (clear b145)
    (on b145 b338)
    (on b338 b41)
    (on-table b41)
    (clear b300)
    (on b300 b182)
    (on-table b182)
    (clear b10)
    (on b10 b72)
    (on b72 b30)
    (on b30 b247)
    (on b247 b325)
    (on-table b325)
    (clear b275)
    (on-table b275)
    (clear b318)
    (on b318 b228)
    (on b228 b8)
    (on b8 b320)
    (on b320 b172)
    (on b172 b303)
    (on b303 b59)
    (on-table b59)
    (clear b337)
    (on b337 b305)
    (on b305 b319)
    (on b319 b267)
    (on b267 b69)
    (on b69 b197)
    (on b197 b216)
    (on b216 b109)
    (on b109 b47)
    (on-table b47)
    (clear b31)
    (on b31 b280)
    (on-table b280)
    (clear b66)
    (on b66 b168)
    (on b168 b44)
    (on b44 b68)
    (on b68 b81)
    (on b81 b343)
    (on-table b343)
    (clear b239)
    (on b239 b28)
    (on-table b28)
    (clear b289)
    (on b289 b348)
    (on b348 b67)
    (on b67 b193)
    (on b193 b51)
    (on b51 b268)
    (on b268 b301)
    (on b301 b142)
    (on b142 b107)
    (on b107 b23)
    (on b23 b136)
    (on b136 b64)
    (on b64 b14)
    (on-table b14)
    (clear b37)
    (on b37 b269)
    (on b269 b261)
    (on b261 b258)
    (on b258 b365)
    (on b365 b196)
    (on b196 b137)
    (on-table b137)
    (clear b265)
    (on-table b265)
    (clear b328)
    (on b328 b346)
    (on b346 b104)
    (on b104 b350)
    (on-table b350)
    (clear b17)
    (on-table b17))
 (:goal  (and 
    (clear b10)
    (on b10 b1)
    (on b1 b4)
    (on-table b4)
    (clear b5)
    (on-table b5)
    (clear b9)
    (on-table b9)
    (clear b2)
    (on b2 b7)
    (on b7 b11)
    (on b11 b6)
    (on b6 b8)
    (on b8 b3)
    (on-table b3))))

; plan
1. (unstack b5 b219)
   deleted: (on b5 b219) (clear b5) (arm-empty)
   added: (holding b5) (clear b219)
   goals met: 2 of 15
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 4 of 15
3. (unstack b183 b82)
   deleted: (on b183 b82) (clear b183) (arm-empty)
   added: (holding b183) (clear b82)
   goals met: 4 of 15
4. (putdown b183)
   deleted: (holding b183)
   added: (clear b183) (arm-empty) (on-table b183)
   goals met: 4 of 15
5. (unstack b238 b143)
   deleted: (on b238 b143) (clear b238) (arm-empty)
   added: (holding b238) (clear b143)
   goals met: 4 of 15
6. (putdown b238)
   deleted: (holding b238)
   added: (clear b238) (arm-empty) (on-table b238)
   goals met: 4 of 15
7. (unstack b143 b6)
   deleted: (on b143 b6) (clear b143) (arm-empty)
   added: (holding b143) (clear b6)
   goals met: 4 of 15
8. (putdown b143)
   deleted: (holding b143)
   added: (clear b143) (arm-empty) (on-table b143)
   goals met: 4 of 15
9. (unstack b292 b290)
   deleted: (on b292 b290) (clear b292) (arm-empty)
   added: (holding b292) (clear b290)
   goals met: 4 of 15
10. (putdown b292)
   deleted: (holding b292)
   added: (clear b292) (arm-empty) (on-table b292)
   goals met: 4 of 15
11. (unstack b290 b151)
   deleted: (on b290 b151) (clear b290) (arm-empty)
   added: (holding b290) (clear b151)
   goals met: 4 of 15
12. (putdown b290)
   deleted: (holding b290)
   added: (clear b290) (arm-empty) (on-table b290)
   goals met: 4 of 15
13. (unstack b151 b1)
   deleted: (on b151 b1) (clear b151) (arm-empty)
   added: (holding b151) (clear b1)
   goals met: 4 of 15
14. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 4 of 15
15. (unstack b302 b70)
   deleted: (on b302 b70) (clear b302) (arm-empty)
   added: (holding b302) (clear b70)
   goals met: 4 of 15
16. (putdown b302)
   deleted: (holding b302)
   added: (clear b302) (arm-empty) (on-table b302)
   goals met: 4 of 15
17. (unstack b313 b13)
   deleted: (on b313 b13) (clear b313) (arm-empty)
   added: (holding b313) (clear b13)
   goals met: 4 of 15
18. (putdown b313)
   deleted: (holding b313)
   added: (clear b313) (arm-empty) (on-table b313)
   goals met: 4 of 15
19. (unstack b13 b358)
   deleted: (on b13 b358) (clear b13) (arm-empty)
   added: (holding b13) (clear b358)
   goals met: 4 of 15
20. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 4 of 15
21. (unstack b318 b228)
   deleted: (on b318 b228) (clear b318) (arm-empty)
   added: (holding b318) (clear b228)
   goals met: 4 of 15
22. (putdown b318)
   deleted: (holding b318)
   added: (clear b318) (arm-empty) (on-table b318)
   goals met: 4 of 15
23. (unstack b228 b8)
   deleted: (on b228 b8) (clear b228) (arm-empty)
   added: (holding b228) (clear b8)
   goals met: 4 of 15
24. (putdown b228)
   deleted: (holding b228)
   added: (clear b228) (arm-empty) (on-table b228)
   goals met: 4 of 15
25. (unstack b358 b252)
   deleted: (on b358 b252) (clear b358) (arm-empty)
   added: (holding b358) (clear b252)
   goals met: 4 of 15
26. (putdown b358)
   deleted: (holding b358)
   added: (clear b358) (arm-empty) (on-table b358)
   goals met: 4 of 15
27. (unstack b252 b9)
   deleted: (on b252 b9) (clear b252) (arm-empty)
   added: (holding b252) (clear b9)
   goals met: 5 of 15
28. (putdown b252)
   deleted: (holding b252)
   added: (clear b252) (arm-empty) (on-table b252)
   goals met: 5 of 15
29. (unstack b9 b359)
   deleted: (on b9 b359) (clear b9) (arm-empty)
   added: (holding b9) (clear b359)
   goals met: 4 of 15
30. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 6 of 15
31. (unstack b359 b260)
   deleted: (on b359 b260) (clear b359) (arm-empty)
   added: (holding b359) (clear b260)
   goals met: 6 of 15
32. (putdown b359)
   deleted: (holding b359)
   added: (clear b359) (arm-empty) (on-table b359)
   goals met: 6 of 15
33. (unstack b260 b116)
   deleted: (on b260 b116) (clear b260) (arm-empty)
   added: (holding b260) (clear b116)
   goals met: 6 of 15
34. (putdown b260)
   deleted: (holding b260)
   added: (clear b260) (arm-empty) (on-table b260)
   goals met: 6 of 15
35. (unstack b116 b60)
   deleted: (on b116 b60) (clear b116) (arm-empty)
   added: (holding b116) (clear b60)
   goals met: 6 of 15
36. (putdown b116)
   deleted: (holding b116)
   added: (clear b116) (arm-empty) (on-table b116)
   goals met: 6 of 15
37. (unstack b60 b189)
   deleted: (on b60 b189) (clear b60) (arm-empty)
   added: (holding b60) (clear b189)
   goals met: 6 of 15
38. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 6 of 15
39. (unstack b189 b201)
   deleted: (on b189 b201) (clear b189) (arm-empty)
   added: (holding b189) (clear b201)
   goals met: 6 of 15
40. (putdown b189)
   deleted: (holding b189)
   added: (clear b189) (arm-empty) (on-table b189)
   goals met: 6 of 15
41. (unstack b201 b61)
   deleted: (on b201 b61) (clear b201) (arm-empty)
   added: (holding b201) (clear b61)
   goals met: 6 of 15
42. (putdown b201)
   deleted: (holding b201)
   added: (clear b201) (arm-empty) (on-table b201)
   goals met: 6 of 15
43. (unstack b61 b270)
   deleted: (on b61 b270) (clear b61) (arm-empty)
   added: (holding b61) (clear b270)
   goals met: 6 of 15
44. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 6 of 15
45. (unstack b270 b354)
   deleted: (on b270 b354) (clear b270) (arm-empty)
   added: (holding b270) (clear b354)
   goals met: 6 of 15
46. (putdown b270)
   deleted: (holding b270)
   added: (clear b270) (arm-empty) (on-table b270)
   goals met: 6 of 15
47. (unstack b354 b203)
   deleted: (on b354 b203) (clear b354) (arm-empty)
   added: (holding b354) (clear b203)
   goals met: 6 of 15
48. (putdown b354)
   deleted: (holding b354)
   added: (clear b354) (arm-empty) (on-table b354)
   goals met: 6 of 15
49. (unstack b203 b323)
   deleted: (on b203 b323) (clear b203) (arm-empty)
   added: (holding b203) (clear b323)
   goals met: 6 of 15
50. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 6 of 15
51. (unstack b323 b7)
   deleted: (on b323 b7) (clear b323) (arm-empty)
   added: (holding b323) (clear b7)
   goals met: 6 of 15
52. (putdown b323)
   deleted: (holding b323)
   added: (clear b323) (arm-empty) (on-table b323)
   goals met: 6 of 15
53. (unstack b70 b210)
   deleted: (on b70 b210) (clear b70) (arm-empty)
   added: (holding b70) (clear b210)
   goals met: 6 of 15
54. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 6 of 15
55. (unstack b210 b180)
   deleted: (on b210 b180) (clear b210) (arm-empty)
   added: (holding b210) (clear b180)
   goals met: 6 of 15
56. (putdown b210)
   deleted: (holding b210)
   added: (clear b210) (arm-empty) (on-table b210)
   goals met: 6 of 15
57. (unstack b180 b327)
   deleted: (on b180 b327) (clear b180) (arm-empty)
   added: (holding b180) (clear b327)
   goals met: 6 of 15
58. (putdown b180)
   deleted: (holding b180)
   added: (clear b180) (arm-empty) (on-table b180)
   goals met: 6 of 15
59. (unstack b327 b237)
   deleted: (on b327 b237) (clear b327) (arm-empty)
   added: (holding b327) (clear b237)
   goals met: 6 of 15
60. (putdown b327)
   deleted: (holding b327)
   added: (clear b327) (arm-empty) (on-table b327)
   goals met: 6 of 15
61. (unstack b237 b3)
   deleted: (on b237 b3) (clear b237) (arm-empty)
   added: (holding b237) (clear b3)
   goals met: 6 of 15
62. (putdown b237)
   deleted: (holding b237)
   added: (clear b237) (arm-empty) (on-table b237)
   goals met: 6 of 15
63. (unstack b3 b214)
   deleted: (on b3 b214) (clear b3) (arm-empty)
   added: (holding b3) (clear b214)
   goals met: 6 of 15
64. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 15
65. (unstack b82 b190)
   deleted: (on b82 b190) (clear b82) (arm-empty)
   added: (holding b82) (clear b190)
   goals met: 7 of 15
66. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 7 of 15
67. (unstack b190 b135)
   deleted: (on b190 b135) (clear b190) (arm-empty)
   added: (holding b190) (clear b135)
   goals met: 7 of 15
68. (putdown b190)
   deleted: (holding b190)
   added: (clear b190) (arm-empty) (on-table b190)
   goals met: 7 of 15
69. (unstack b135 b4)
   deleted: (on b135 b4) (clear b135) (arm-empty)
   added: (holding b135) (clear b4)
   goals met: 7 of 15
70. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 7 of 15
71. (unstack b4 b306)
   deleted: (on b4 b306) (clear b4) (arm-empty)
   added: (holding b4) (clear b306)
   goals met: 7 of 15
72. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 8 of 15
73. (unstack b1 b21)
   deleted: (on b1 b21) (clear b1) (arm-empty)
   added: (holding b1) (clear b21)
   goals met: 8 of 15
74. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 9 of 15
75. (unstack b11 b92)
   deleted: (on b11 b92) (clear b11) (arm-empty)
   added: (holding b11) (clear b92)
   goals met: 9 of 15
76. (stack b11 b6)
   deleted: (clear b6) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b6)
   goals met: 10 of 15
77. (unstack b7 b112)
   deleted: (on b7 b112) (clear b7) (arm-empty)
   added: (holding b7) (clear b112)
   goals met: 10 of 15
78. (stack b7 b11)
   deleted: (clear b11) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b11)
   goals met: 11 of 15
79. (unstack b8 b320)
   deleted: (on b8 b320) (clear b8) (arm-empty)
   added: (holding b8) (clear b320)
   goals met: 11 of 15
80. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 12 of 15
81. (unstack b10 b72)
   deleted: (on b10 b72) (clear b10) (arm-empty)
   added: (holding b10) (clear b72)
   goals met: 11 of 15
82. (stack b10 b1)
   deleted: (clear b1) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b1)
   goals met: 13 of 15
83. (unstack b7 b11)
   deleted: (on b7 b11) (clear b7) (arm-empty)
   added: (holding b7) (clear b11)
   goals met: 12 of 15
84. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 12 of 15
85. (unstack b11 b6)
   deleted: (on b11 b6) (clear b11) (arm-empty)
   added: (holding b11) (clear b6)
   goals met: 11 of 15
86. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 11 of 15
87. (unstack b6 b16)
   deleted: (on b6 b16) (clear b6) (arm-empty)
   added: (holding b6) (clear b16)
   goals met: 11 of 15
88. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 12 of 15
89. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 12 of 15
90. (stack b11 b6)
   deleted: (clear b6) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b6)
   goals met: 13 of 15
91. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 13 of 15
92. (stack b7 b11)
   deleted: (clear b11) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b11)
   goals met: 14 of 15
93. (unstack b2 b56)
   deleted: (on b2 b56) (clear b2) (arm-empty)
   added: (holding b2) (clear b56)
   goals met: 13 of 15
94. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 15 of 15
